vanvught/GD32F407RE-DMX512-RDM/lib-network/src/emac/gd32/emac_phy.cpp
/**
 * net_phy.cpp
 *
 */
/* Copyright (C) 2023-2026 by Arjan van Vught mailto:info@gd32-dmx.org
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <cstdint>

#include "emac/emac_phy.h"
#include "emac/mmi.h"
#include "firmware/debug/debug_printbits.h"
#include "gd32_timers.h"
#include "emac/emac_debug.h"
#include "gd32.h" // IWYU pragma: keep
#include "firmware/ansi_colour.h"

namespace emac::phy {
bool Read(uint16_t address, uint16_t reg, uint16_t& value) {
#ifdef GD32H7XX
    const auto kResult = enet_phy_write_read(ENETx, ENET_PHY_READ, address, reg, &value) == SUCCESS;
#else
    const auto kResult = enet_phy_write_read(ENET_PHY_READ, address, reg, &value) == SUCCESS;
#endif // GD32H7XX
    return kResult;
}

bool Write(uint16_t address, uint16_t reg, uint16_t value) {
#ifdef GD32H7XX
    const auto kResult = enet_phy_write_read(ENETx, ENET_PHY_WRITE, address, reg, &value) == SUCCESS;
#else
    const auto kResult = enet_phy_write_read(ENET_PHY_WRITE, address, reg, &value) == SUCCESS;
#endif // GD32H7XX
    return kResult;
}

bool Config(uint16_t address) {
    EMAC_PHY_DEBUG_ENTRY();

#ifdef GD32H7XX
    auto reg = ENET_MAC_PHY_CTL(ENETx);
#else
    auto reg = ENET_MAC_PHY_CTL;
#endif // GD32H7XX
    reg &= ~ENET_MAC_PHY_CTL_CLR;

    const auto kAhbClk = rcu_clock_freq_get(CK_AHB);

    EMAC_PHY_DEBUG_PRINTF("kAhbClk=%u", static_cast<unsigned>(kAhbClk));

#ifdef GD32F10X_CL
    if (ENET_RANGE(kAhbClk, 20000000U, 35000000U)) {
        reg |= ENET_MDC_HCLK_DIV16;
    } else if (ENET_RANGE(kAhbClk, 35000000U, 60000000U)) {
        reg |= ENET_MDC_HCLK_DIV26;
    } else if (ENET_RANGE(kAhbClk, 60000000U, 90000000U)) {
        reg |= ENET_MDC_HCLK_DIV42;
    } else if ((ENET_RANGE(kAhbClk, 90000000U, 108000000U)) || (108000000U == kAhbClk)) {
        reg |= ENET_MDC_HCLK_DIV62;
    } else {
        EMAC_PHY_DEBUG_EXIT();
        return false;
    }
#elif defined GD32F20X
    if (ENET_RANGE(kAhbClk, 20000000U, 35000000U)) {
        reg |= ENET_MDC_HCLK_DIV16;
    } else if (ENET_RANGE(kAhbClk, 35000000U, 60000000U)) {
        reg |= ENET_MDC_HCLK_DIV26;
    } else if (ENET_RANGE(kAhbClk, 60000000U, 100000000U)) {
        reg |= ENET_MDC_HCLK_DIV42;
    } else if ((ENET_RANGE(kAhbClk, 100000000U, 120000000U)) || (120000000U == kAhbClk)) {
        reg |= ENET_MDC_HCLK_DIV62;
    } else {
        EMAC_PHY_DEBUG_EXIT();
        return false;
    }
#elif defined GD32F4XX
    if (ENET_RANGE(kAhbClk, 20000000U, 35000000U)) {
        reg |= ENET_MDC_HCLK_DIV16;
    } else if (ENET_RANGE(kAhbClk, 35000000U, 60000000U)) {
        reg |= ENET_MDC_HCLK_DIV26;
    } else if (ENET_RANGE(kAhbClk, 60000000U, 100000000U)) {
        reg |= ENET_MDC_HCLK_DIV42;
    } else if (ENET_RANGE(kAhbClk, 100000000U, 150000000U)) {
        reg |= ENET_MDC_HCLK_DIV62;
    } else if ((ENET_RANGE(kAhbClk, 150000000U, 240000000U)) || (240000000U == kAhbClk)) {
        reg |= ENET_MDC_HCLK_DIV102;
    } else {
        EMAC_PHY_DEBUG_EXIT();
        return false;
    }
#elif defined GD32H7XX
    if (ENET_RANGE(kAhbClk, 20000000U, 35000000U)) {
        reg |= ENET_MDC_HCLK_DIV16;
    } else if (ENET_RANGE(kAhbClk, 35000000U, 60000000U)) {
        reg |= ENET_MDC_HCLK_DIV26;
    } else if (ENET_RANGE(kAhbClk, 60000000U, 100000000U)) {
        reg |= ENET_MDC_HCLK_DIV42;
    } else if (ENET_RANGE(kAhbClk, 100000000U, 150000000U)) {
        reg |= ENET_MDC_HCLK_DIV62;
    } else if ((ENET_RANGE(kAhbClk, 150000000U, 180000000U)) || (180000000U == kAhbClk)) {
        reg |= ENET_MDC_HCLK_DIV102;
    } else if (ENET_RANGE(kAhbClk, 250000000U, 300000000U)) {
        reg |= ENET_MDC_HCLK_DIV124;
    } else if (ENET_RANGE(kAhbClk, 300000000U, 350000000U)) {
        reg |= ENET_MDC_HCLK_DIV142;
    } else if ((ENET_RANGE(kAhbClk, 350000000U, 400000000U)) || (400000000U == kAhbClk)) {
        reg |= ENET_MDC_HCLK_DIV162;
    } else {
        EMAC_PHY_DEBUG_EXIT();
        return false;
    }
#else
#error
#endif // GD32F10X_CL

#ifdef GD32H7XX
    ENET_MAC_PHY_CTL(ENETx) = reg;
#else
    ENET_MAC_PHY_CTL = reg;
#endif // GD32H7XX

    if (!phy::Write(address, emac::mmi::REG_BMCR, emac::mmi::BMCR_RESET)) {
        puts("PHY reset failed");
        EMAC_PHY_DEBUG_EXIT();
        return false;
    }

    // Poll the control register for the reset bit to go to 0 (it is
    // auto-clearing).  This should happen within 0.5 seconds per the IEEE spec.

    const auto kMillis = gd32::Millis();
    uint16_t value;

    while (gd32::Millis() - kMillis < 600U) {
        if (!phy::Read(address, emac::mmi::REG_BMCR, value)) {
            puts("PHY status read failed");
            EMAC_PHY_DEBUG_EXIT();
            return false;
        }

        if (!(value & emac::mmi::BMCR_RESET)) {
            EMAC_PHY_DEBUG_PRINTF("%u", static_cast<unsigned>(gd32::Millis() - kMillis));
            EMAC_PHY_DEBUG_EXIT();
            debug::PrintBits(value, "BMCR");

            phy::Read(address, mmi::REG_BMSR, value);
            debug::PrintBits(value, "BMSR");
            return true;
        }
    }

    if (value & emac::mmi::BMCR_RESET) {
        puts("PHY reset timed out");
        EMAC_PHY_DEBUG_EXIT();
        return false;
    }

    EMAC_PHY_DEBUG_EXIT();
    return true;
}

namespace link {
#if defined(ENET_LINK_CHECK_USE_INT) || defined(ENET_LINK_CHECK_USE_PIN_POLL)
void GpioInit() {
    rcu_periph_clock_enable(LINK_CHECK_GPIO_CLK);
    LINK_CHECK_GPIO_CONFIG;
}
#endif // defined(ENET_LINK_CHECK_USE_INT) || defined(ENET_LINK_CHECK_USE_PIN_POLL)

#ifdef ENET_LINK_CHECK_USE_INT
void ExtiInit() {
    rcu_periph_clock_enable(LINK_CHECK_EXTI_CLK);

    NVIC_SetPriority(LINK_CHECK_EXTI_IRQn, 7);
    NVIC_EnableIRQ(LINK_CHECK_EXTI_IRQn);

    LINK_CHECK_EXTI_SOURCE_CONFIG(LINK_CHECK_EXTI_PORT_SOURCE, LINK_CHECK_EXTI_PIN_SOURCE);

    exti_init(LINK_CHECK_EXTI_LINE, EXTI_INTERRUPT, EXTI_TRIG_FALLING);
    exti_interrupt_flag_clear(LINK_CHECK_EXTI_LINE);
}
#endif // ENET_LINK_CHECK_USE_INT

#ifdef ENET_LINK_CHECK_USE_PIN_POLL
void PinPoll() {
    if (RESET == gpio_input_bit_get(LINK_CHECK_GPIO_PORT, LINK_CHECK_GPIO_PIN)) {
        PinRecovery();
        HandleChange();
    }
}
#endif // ENET_LINK_CHECK_USE_PIN_POLL
} // namespace link

#ifdef ENET_LINK_CHECK_USE_INT
extern "C" {
void LINK_CHECK_IRQ_HANDLE() {
    if (RESET != exti_interrupt_flag_get(LINK_CHECK_EXTI_LINE)) {
        exti_interrupt_flag_clear(LINK_CHECK_EXTI_LINE);
        emac::phy::link::PinRecovery();
        emac::phy::link::HandleChange();
    }
}
}
#endif // ENET_LINK_CHECK_USE_INT
} // namespace emac::phy
